## Tap external sources ##

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "azure/functions"
# tap "vitorgalvao/tiny-scripts"

## Homebrew applications ##

# Utility bundles
brew "coreutils"                  # GNU Coreutils
brew "moreutils"                  # Missing Coreutils

# Essential
brew "curl"
brew "grep"
brew "vim"                        # Update to Vim8
brew "wget"
brew "zsh"                        # Better shell
brew "zsh-completions"            # Even better shell

# Missing Utilities
brew "1password-cli"              # 1password CLI
brew "fdupes"                     # Finding duplicate files
brew "jo"                         # JSON output from CLI
brew "jq"                         # CLI JSON processor
brew "nmap"                       # Network Mapper
brew "p7zip"                      # Unzip weird stuff
brew "tmux"                       # Terminal multiplexer
brew "tree"                       # Tree view for folder content

# Developer tools
brew "azure/functions/azure-functions-core-tools@4"
brew "git"                        # Git
brew "git-extras"                 # Better git tools
brew "gh"                         # Github CLI
brew "helm"                       # K8s application management
brew "hub"                        # Github flavoured Git
brew "icdiff"                     # Improved colored diff
brew "iproute2mac"                # Run "ip addr show" on mac
brew "k6"                         # k6.io - loadtesting
brew "peco"                       # Simplistic interactive filtering tool
brew "progress"                   # Show progress for cp, mv, dd, ..
brew "pyenv"                      # Python Envoronments
brew "shellcheck"                 # Static analysis of shell scripts
brew "the_silver_searcher"        # Code searching tool, like grep
# brew "act"                        # Run your GitHub Actions locally

# Runtime Envoronments
brew "node@16"                    # NodeJS
# brew "postgresql@14"              # PostgreSQL Database

# Cloud CLI Tools
brew "azure-cli"                  # Azure Commandline Tools
# brew "awscli"                   # AWS Commandline Tools
# brew "doctl"                    # DigitalOcean Commandline Tools

# Brew cask repair
# brew "vitorgalvao/tiny-scripts/cask-repair"

# MacAppStore
brew "mas"                        # CLI version of Mac App Store

## Cask applications ##

cask_args appdir: "/Applications"

# Terminal
cask "iterm2"                     # Replacement terminal with shell integration
cask "sekey"                      # Use Touch ID / Secure Enclave for SSH Authentication!

# Browsers
cask "brave-browser"
cask "firefox"
cask "google-chrome"

# Communications
cask "discord"                    # Community and voice Chats
cask "mattermost"                 # Team chats
cask "signal"                     # Encrypted communications
# cask "skype"                      # Online video calls, chat
# cask "mumble"                     # Voice chat, seasonal usage
# cask "rocket-chat"                # Team chats, seasonal usage
# cask "slack"                      # Team chats

# Media
# cask "soundcleod"               # Soundcloud desktop application

# Utilities
cask "1password"                  # Install 1password7
cask "alfred"                     # Little helper all around
cask "appcleaner"                 # Application remover
cask "bartender"                  # Menu bar helper
cask "dropbox"                    # Filesharing
cask "gpg-suite"                  # Encryption
cask "hazel"                      # Automated organization of files
cask "little-snitch"              # Application Firewall, this only doVwnloads the installer, needs additional steps
cask "micro-snitch"               # Tracks app attempts to use your microphone or camera
cask "numi"                       # Text calculator
cask "swish"                      # The missing gesture layer for macOS
cask "the-unarchiver"             # Application for unarchiving files
# cask "aldente"                  # Power management
# cask "balenaetcher"             # Writing images to USB and SD cards
# cask "hazeover"                 # Helps to focus on app, !plan to use brew version
# cask "keycastr"                 # Screencasting key presses

# Developer Tools
cask "atom"                       # Gegeral IDE
cask "docker"                     # Docker for Mac
cask "postman"                    # API testing / building
cask "postman-agent"
# cask "arduino"                  # Aruduino IDE
# cask "visual-studio-code"       # IDE for some programming work

# Business needs
# cask "forticlient-vpn"
# cask "microsoft-remote-desktop"

# 3D Printing / Designer
# cask "ultimaker-cura"

## Fonts

cask "font-hack-nerd-font"

## MacAppStore ##

# Utilities
mas "Daisydisk",	id: 411643860           # See how you use space on your harddrives
mas "DigiDoc4 Client",	id: 1370791134    # Digital signing application for EstEID
mas "HazeOver",		id: 430798174           # Helps to focus on app
mas "Next Meeting",	id: 1017470484        # Display next calendar meeting in menu bar

# Media
# mas "Final Cut Pro",	id: 424389933

# Office alternative
# mas "Keynote",	id: 409183694
# mas "Numbers",	id: 409203825
# mas "Pages",		id: 409201541

# Developer Tools
# mas "XCode",		id: 497799835
