## Tap external sources ##

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

## Homebrew applications ##

# Utility bundles
brew 'coreutils'		# GNU Coreutils
brew 'moreutils'		# Missing Coreutils

# Essential
brew 'vim'			# Update to Vim8
brew 'zsh'			# Better shell

# Missing Utilities
brew 'curl'
brew 'grep', args: ['with-default-names']
brew 'jo'			# JSON output from CLI
brew 'jq'			# CLI JSON processor
brew 'nmap'			# Network Mapper
brew 'p7zip'			# Unzip weird stuff
brew 'tmux'			# Terminal multiplexer
brew 'tree'			# Tree view for folder content
brew 'wget'

# Developer tools
brew 'doctl'			# A command line tool for DigitalOcean services
brew 'git'			# Git
brew 'git-standup'		# Better git log, multiple repo support
brew 'hub'			# Github flavoured Git
brew 'icdiff'			# Improved colored diff
brew 'iproute2mac'		# Run "ip addr show" on mac
brew 'progress'			# Show progress for cp, mv, dd, ..
brew 'the_silver_searcher'	# Code searching tool, like grep
brew 'peco'			# Simplistic interactive filtering tool

# MacAppStore
brew 'mas'			# CLI version of Mac App Store

## Cask applications ##

cask_args appdir: '/Applications'

# Terminal
cask 'iterm2'			# Replacement terminal with shell integration

# Browsers
cask 'firefox'
cask 'google-chrome'

# Communications
cask 'signal'			# Encrypted communications
cask 'skype'			# Online video calls, chat
cask 'slack'			# Team chats
# cask 'mumble'			# Voice chat, seasonal usage
# cask 'rocket-chat'		# Team chats, seasonal usage

# Media
# cask 'soundcleod'		# Soundcloud desktop application

# Utilities
cask 'alfred'			# Little helper all around
cask 'appcleaner'		# Application remover
cask 'bartender'		# Menu bar helper
cask 'gpg-suite'		# Encryption
cask 'hazel'			# Automated organization of files
cask 'micro-snitch'		# Tracks app attempts to use your microphone or camera
cask 'numi'			# Text calculator
cask '1password'		# Install 1password7
# cask 'etcher'			# Writing images to USB and SD cards
# cask 'keycastr'		# Screencasting key presses
# cask 'little-snitch'		# Application Firewall, this only downloads the installer, needs additional steps

# Developer Tools
cask 'atom'			# Gegeral IDE
# cask 'arduino'		# Aruduino IDE

# 3D Printing / Designer
# cask 'ultimaker-cura'

## Fonts

cask "font-hack-nerd-font"

## MacAppStore ##

# E-mail
mas 'Airmail 3',	id: 918858936		# Preferred email client

# Utilities
mas 'DigiDoc4 Client',	id: 1370791134		# Digital signing application for EstEID
mas 'HazeOver',		id: 430798174		# Helps to focus on app
mas 'Next Meeting',	id: 1017470484		# Display next calendar meeting in menu bar
# mas 'Daisydisk',	id: 411643860		# See how you use space on your harddrives

# Media 
# mas 'Final Cut Pro',	id: 424389933

# Office alternative
# mas 'Keynote',	id: 409183694
# mas 'Numbers',	id: 409203825
# mas 'Pages',		id: 409201541

# Developer Tools
# mas 'XCode',		id: 497799835
